OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_ecdsa_sign.c
/**
 * Copyright (c) 2018 - 2019, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */

#include <stdio.h>
#include <stdarg.h>
#include <string.h>
#include <stddef.h>
#include "nrf_gpio.h"
#include "nrf_delay.h"
#include "nrf_error.h"
#include "app_util.h"
#include "nrf_section.h"
#include "nrf_crypto.h"
#include "common_test.h"

/**@brief ECDSA test vectors can be found on NIST web pages.
 *
 * https://csrc.nist.gov/Projects/Cryptographic-Algorithm-Validation-Program/Component-Testing
 */

/*lint -save -e91 */

#if NRF_CRYPTO_ECC_ENABLED && !NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_CC310_BL) && !NRF_MODULE_ENABLED(NRF_CRYPTO_BACKEND_OPTIGA)

#if NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP160R1)
#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP160R1)
#if NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP160R2)
#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP160R2)
#if NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP192R1)
#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP192R1)

#if NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP224R1)

// ECDSA sign - NIST CAVS 11.2 P-224, SHA-256 - first test case
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_sign_data, test_vector_ecdsa_sign_t test_vector_ecdsa_sign_secp224r1_sha256_1) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp224r1_curve_info,
    .expected_sign_err_code     = NRF_SUCCESS,
    .expected_verify_err_code   = NRF_SUCCESS,
    .p_test_vector_name         = "secp224r1 valid sha256 1",
    .p_input                    = "00c6fc53c1986d19a8a8b580ee553dc1240745d760647d1c0adf442c133c7f56",
    .p_qx                       = "4c741e4d20103670b7161ae72271082155838418084335338ac38fa4",
    .p_qy                       = "db7919151ac28587b72bad7ab180ec8e95ab9e2c8d81d9b9d7e2e383",
    .p_x                        = "888fc992893bdd8aa02c80768832605d020b81ae0b25474154ec89aa"
};

// ECDSA sign - NIST CAVS 11.2 P-224, SHA-256 - second test case
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_sign_data, test_vector_ecdsa_sign_t test_vector_ecdsa_sign_secp224r1_sha256_2) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp224r1_curve_info,
    .expected_sign_err_code     = NRF_SUCCESS,
    .expected_verify_err_code   = NRF_SUCCESS,
    .p_test_vector_name         = "secp224r1 valid sha256 2",
    .p_input                    = "fb5dd3b8d280fe7c4838f01b2a5c28493ed3084f46b40642600ba39e43fbff7b",
    .p_qx                       = "897089f4ef05b943eeac06589f0e09ccc571a6add3eb1610a2fc830f",
    .p_qy                       = "62ba3f6b3e6f0f062058b93e6f25b6041246c5be13584a41cae7e244",
    .p_x                        = "5b5a3e186e7d5b9b0fbdfc74a05e0a3d85dc4be4c87269190c839972"
};

// ECDSA sign - NIST CAVS 11.2 P-224, SHA-256 - third test case
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_sign_data, test_vector_ecdsa_sign_t test_vector_ecdsa_sign_secp224r1_sha256_3) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp224r1_curve_info,
    .expected_sign_err_code     = NRF_SUCCESS,
    .expected_verify_err_code   = NRF_SUCCESS,
    .p_test_vector_name         = "secp224r1 valid sha256 3",
    .p_input                    = "f4083aebe08c9bdb8c08ff844ffc207f80fa4406fb73bdbc1c6020f71281bdae",
    .p_qx                       = "40a4ab1e6a9f84b4dedb81795e6a7124d1cfdfd7ec64c5d4b9e32666",
    .p_qy                       = "83aa32a3c2fc068e62626f2dafce5d7f050e826e5c145cd2d13d1b27",
    .p_x                        = "f60b3a4d4e31c7005a3d2d0f91cb096d016a8ddb5ab10ecb2a549170"
};

// ECDSA sign - NIST CAVS 11.2 P-224, SHA-512 - first test case
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_sign_data, test_vector_ecdsa_sign_t test_vector_ecdsa_sign_secp224r1_sha512_1) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp224r1_curve_info,
    .expected_sign_err_code     = NRF_SUCCESS,
    .expected_verify_err_code   = NRF_SUCCESS,
    .p_test_vector_name         = "secp224r1 valid sha512 1",
    .p_input                    = "3edbb59a32b2464291d0a96023a798c1fc6cb5ff4fcecfadcfac2be00c26fa27181aef76c96d8269aeaf2275eeacbb777abbd9571de9279edc5695a3345cad9b",
    .p_qx                       = "ac635fe00e8b7a3c8ef5655bdfb7f83e8532e59c0cc0b6534d810ffa",
    .p_qy                       = "1d067aebeba66e79b28ecfe59ac6fdf5e1970dc3a84499c9d90cd8e2",
    .p_x                        = "ba5374541c13597bded6880849184a593d69d3d4f0b1cb4d0919cbd6"
};

// ECDSA sign - NIST CAVS 11.2 P-224, SHA-512 - second test case
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_sign_data, test_vector_ecdsa_sign_t test_vector_ecdsa_sign_secp224r1_sha512_2) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp224r1_curve_info,
    .expected_sign_err_code     = NRF_SUCCESS,
    .expected_verify_err_code   = NRF_SUCCESS,
    .p_test_vector_name         = "secp224r1 valid sha512 2",
    .p_input                    = "825ab979af5c263d9f074a2d771d1d1cdfa435e7938245a3c9ee30cb77ee8c1475051d2f09d7d11d920a6c754bfd253903131c491994679cafdb8cfbf32b763d",
    .p_qx                       = "ecaea8ceea55c3bd418fd34a4ff2499e25e66a104eed846bc00c31d2",
    .p_qy                       = "3933a356ab1f2dabc303ff0a5d076131e77032e6f502336883bf78a7",
    .p_x                        = "1e27187134d0a63542adf4665fba22f00cfc7b0a1e02effe913ceedc"
};

// ECDSA sign - NIST CAVS 11.2 P-224, SHA-512 - third test case
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_sign_data, test_vector_ecdsa_sign_t test_vector_ecdsa_sign_secp224r1_sha512_3) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp224r1_curve_info,
    .expected_sign_err_code     = NRF_SUCCESS,
    .expected_verify_err_code   = NRF_SUCCESS,
    .p_test_vector_name         = "secp224r1 valid sha512 3",
    .p_input                    = "d0db7c20c201cd8c63ca777293543750d7f6a9e375b056e74cfe9fb2c95b2cc9807d8a9607a5b0fad6eeda86e4f73ace139e77a5356181b8cbef3f88173253b6",
    .p_qx                       = "d656b73b131aa4c6336a57849ce0d3682b6ab2113d013711e8c29762",
    .p_qy                       = "6328335ffc2029afbfe2a15cc5636978778c3f9dab84840b05f2e705",
    .p_x                        = "0905b40e6c29bfcbf55e04266f68f10ca8d3905001d68bb61a27749b"
};

// ECDSA sign - NIST CAVS 11.2 P-224, SHA-256 - invalid Q test case
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_sign_data, test_vector_ecdsa_sign_t test_vector_ecdsa_sign_secp224r1_sha256_inv_q) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp224r1_curve_info,
    .expected_sign_err_code     = NRF_SUCCESS,
    .expected_verify_err_code   = NRF_ERROR_CRYPTO_ECDSA_INVALID_SIGNATURE,
    .p_test_vector_name         = "secp224r1 Q changed sha256",
    .p_input                    = "00c6fc53c1986d19a8a8b580ee553dc1240745d760647d1c0adf442c133c7f56",
    .p_qx                       = "897089f4ef05b943eeac06589f0e09ccc571a6add3eb1610a2fc830f",
    .p_qy                       = "62ba3f6b3e6f0f062058b93e6f25b6041246c5be13584a41cae7e244",
    .p_x                        = "888fc992893bdd8aa02c80768832605d020b81ae0b25474154ec89aa"
};

// ECDSA sign - NIST CAVS 11.2 P-224, SHA-256 - invalid X test case
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_sign_data, test_vector_ecdsa_sign_t test_vector_ecdsa_sign_secp224r1_sha256_inv_x) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp224r1_curve_info,
    .expected_sign_err_code     = NRF_SUCCESS,
    .expected_verify_err_code   = NRF_ERROR_CRYPTO_ECDSA_INVALID_SIGNATURE,
    .p_test_vector_name         = "secp224r1 X changed sha256",
    .p_input                    = "00c6fc53c1986d19a8a8b580ee553dc1240745d760647d1c0adf442c133c7f56",
    .p_qx                       = "4c741e4d20103670b7161ae72271082155838418084335338ac38fa4",
    .p_qy                       = "db7919151ac28587b72bad7ab180ec8e95ab9e2c8d81d9b9d7e2e383",
    .p_x                        = "5b5a3e186e7d5b9b0fbdfc74a05e0a3d85dc4be4c87269190c839972"
};

// ECDSA sign - NIST CAVS 11.2 P-224, SHA-512 - invalid Q test case
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_sign_data, test_vector_ecdsa_sign_t test_vector_ecdsa_sign_secp224r1_sha512_inv_q) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp224r1_curve_info,
    .expected_sign_err_code     = NRF_SUCCESS,
    .expected_verify_err_code   = NRF_ERROR_CRYPTO_ECDSA_INVALID_SIGNATURE,
    .p_test_vector_name         = "secp224r1 Q changed sha512",
    .p_input                    = "3edbb59a32b2464291d0a96023a798c1fc6cb5ff4fcecfadcfac2be00c26fa27181aef76c96d8269aeaf2275eeacbb777abbd9571de9279edc5695a3345cad9b",
    .p_qx                       = "ecaea8ceea55c3bd418fd34a4ff2499e25e66a104eed846bc00c31d2",
    .p_qy                       = "3933a356ab1f2dabc303ff0a5d076131e77032e6f502336883bf78a7",
    .p_x                        = "ba5374541c13597bded6880849184a593d69d3d4f0b1cb4d0919cbd6"
};

// ECDSA sign - NIST CAVS 11.2 P-224, SHA-512 - invalid X test case
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_sign_data, test_vector_ecdsa_sign_t test_vector_ecdsa_sign_secp224r1_sha512_inv_x) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp224r1_curve_info,
    .expected_sign_err_code     = NRF_SUCCESS,
    .expected_verify_err_code   = NRF_ERROR_CRYPTO_ECDSA_INVALID_SIGNATURE,
    .p_test_vector_name         = "secp224r1 X changed sha512",
    .p_input                    = "3edbb59a32b2464291d0a96023a798c1fc6cb5ff4fcecfadcfac2be00c26fa27181aef76c96d8269aeaf2275eeacbb777abbd9571de9279edc5695a3345cad9b",
    .p_qx                       = "ac635fe00e8b7a3c8ef5655bdfb7f83e8532e59c0cc0b6534d810ffa",
    .p_qy                       = "1d067aebeba66e79b28ecfe59ac6fdf5e1970dc3a84499c9d90cd8e2",
    .p_x                        = "1e27187134d0a63542adf4665fba22f00cfc7b0a1e02effe913ceedc"
};
#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP224R1)

#if NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP256R1)

