OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_ecdsa_sign.c
// ECDSA sign - NIST CAVS 11.2 P-256, SHA-256 - first test case
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_sign_data, test_vector_ecdsa_sign_t test_vector_ecdsa_sign_secp256r1_sha256_1) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp256r1_curve_info,
    .expected_sign_err_code     = NRF_SUCCESS,
    .expected_verify_err_code   = NRF_SUCCESS,
    .p_test_vector_name         = "secp256r1 valid sha256 1",
    .p_input                    = "44acf6b7e36c1342c2c5897204fe09504e1e2efb1a900377dbc4e7a6a133ec56",
    .p_qx                       = "1ccbe91c075fc7f4f033bfa248db8fccd3565de94bbfb12f3c59ff46c271bf83",
    .p_qy                       = "ce4014c68811f9a21a1fdb2c0e6113e06db7ca93b7404e78dc7ccd5ca89a4ca9",
    .p_x                        = "519b423d715f8b581f4fa8ee59f4771a5b44c8130b4e3eacca54a56dda72b464"
};

// ECDSA sign - NIST CAVS 11.2 P-256, SHA-256 - second test case
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_sign_data, test_vector_ecdsa_sign_t test_vector_ecdsa_sign_secp256r1_sha256_2) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp256r1_curve_info,
    .expected_sign_err_code     = NRF_SUCCESS,
    .expected_verify_err_code   = NRF_SUCCESS,
    .p_test_vector_name         = "secp256r1 valid sha256 2",
    .p_input                    = "9b2db89cb0e8fa3cc7608b4d6cc1dec0114e0b9ff4080bea12b134f489ab2bbc",
    .p_qx                       = "e266ddfdc12668db30d4ca3e8f7749432c416044f2d2b8c10bf3d4012aeffa8a",
    .p_qy                       = "bfa86404a2e9ffe67d47c587ef7a97a7f456b863b4d02cfc6928973ab5b1cb39",
    .p_x                        = "0f56db78ca460b055c500064824bed999a25aaf48ebb519ac201537b85479813"
};

// ECDSA sign - NIST CAVS 11.2 P-256, SHA-256 - third test case
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_sign_data, test_vector_ecdsa_sign_t test_vector_ecdsa_sign_secp256r1_sha256_3) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp256r1_curve_info,
    .expected_sign_err_code     = NRF_SUCCESS,
    .expected_verify_err_code   = NRF_SUCCESS,
    .p_test_vector_name         = "secp256r1 valid sha256 3",
    .p_input                    = "b804cf88af0c2eff8bbbfb3660ebb3294138e9d3ebd458884e19818061dacff0",
    .p_qx                       = "74ccd8a62fba0e667c50929a53f78c21b8ff0c3c737b0b40b1750b2302b0bde8",
    .p_qy                       = "29074e21f3a0ef88b9efdf10d06aa4c295cc1671f758ca0e4cd108803d0f2614",
    .p_x                        = "e283871239837e13b95f789e6e1af63bf61c918c992e62bca040d64cad1fc2ef"
};

// ECDSA sign - NIST CAVS 11.2 P-256, SHA-512 - first test case
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_sign_data, test_vector_ecdsa_sign_t test_vector_ecdsa_sign_secp256r1_sha512_1) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp256r1_curve_info,
    .expected_sign_err_code     = NRF_SUCCESS,
    .expected_verify_err_code   = NRF_SUCCESS,
    .p_test_vector_name         = "secp256r1 valid sha512 1",
    .p_input                    = "a59ca4dd2b0347f4f2702a8962878a206775fd91047040be60463119f02aa829b7360b940b2785395406c280375c5d90ee655e51d4120df256b9a6287161c7fc",
    .p_qx                       = "6b738de3398b6ac57b9591f9d7985dd4f32137ad3460dcf8970c1390cb9eaf8d",
    .p_qy                       = "83bc61e26d2bbbd3cf2d2ab445a2bc4ab5dde41f4a13078fd1d3cc36ab596d57",
    .p_x                        = "9dd0d3a3d514c2a8adb162b81e3adfba3299309f7d2018f607bdb15b1a25f499"
};

// ECDSA sign - NIST CAVS 11.2 P-256, SHA-512 - second test case
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_sign_data, test_vector_ecdsa_sign_t test_vector_ecdsa_sign_secp256r1_sha512_2) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp256r1_curve_info,
    .expected_sign_err_code     = NRF_SUCCESS,
    .expected_verify_err_code   = NRF_SUCCESS,
    .p_test_vector_name         = "secp256r1 valid sha512 2",
    .p_input                    = "9e359350e87e7573ad9894cd4aad6c6202a58e9938d098dbf65650fc6f04fce3664b9adb234bfa0821788223a306daaa3e62bd46b19d7eb7a725bc5bce8998f3",
    .p_qx                       = "f2a6674d4e86152a527199bed293fa63acde1b4d8a92b62e552210ba45c38792",
    .p_qy                       = "c72565c24f0eee6a094af341ddd8579747b865f91c8ed5b44cda8a19cc93776f",
    .p_x                        = "f9bf909b7973bf0e3dad0e43dcb2d7fa8bda49dbe6e5357f8f0e2bd119be30e6"
};

// ECDSA sign - NIST CAVS 11.2 P-256, SHA-512 - third test case
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_sign_data, test_vector_ecdsa_sign_t test_vector_ecdsa_sign_secp256r1_sha512_3) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp256r1_curve_info,
    .expected_sign_err_code     = NRF_SUCCESS,
    .expected_verify_err_code   = NRF_SUCCESS,
    .p_test_vector_name         = "secp256r1 valid sha512 3",
    .p_input                    = "ff5e80ccbb51b75742a1f0e632b4c6cd119692f2aca337378f7eb2f3b17fc3d912828b7e1655d2263d8757715eea31493aa89dfe1db143a8fa13f89a00379938",
    .p_qx                       = "70b877b5e365fcf08140b1eca119baba662879f38e059d074a2cb60b03ea5d39",
    .p_qy                       = "5f56f94d591df40b9f3b8763ac4b3dbe622c956d5bd0c55658b6f46fa3deb201",
    .p_x                        = "724567d21ef682dfc6dc4d46853880cfa86fe6fea0efd51fac456f03c3d36ead"
};

// ECDSA sign - NIST CAVS 11.2 P-256, SHA-256 - invalid Q test case
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_sign_data, test_vector_ecdsa_sign_t test_vector_ecdsa_sign_secp256r1_sha256_inv_q) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp256r1_curve_info,
    .expected_sign_err_code     = NRF_SUCCESS,
    .expected_verify_err_code   = NRF_ERROR_CRYPTO_ECDSA_INVALID_SIGNATURE,
    .p_test_vector_name         = "secp256r1 Q changed sha256",
    .p_input                    = "44acf6b7e36c1342c2c5897204fe09504e1e2efb1a900377dbc4e7a6a133ec56",
    .p_qx                       = "e266ddfdc12668db30d4ca3e8f7749432c416044f2d2b8c10bf3d4012aeffa8a",
    .p_qy                       = "bfa86404a2e9ffe67d47c587ef7a97a7f456b863b4d02cfc6928973ab5b1cb39",
    .p_x                        = "519b423d715f8b581f4fa8ee59f4771a5b44c8130b4e3eacca54a56dda72b464"
};

// ECDSA sign - NIST CAVS 11.2 P-256, SHA-512 - invalid Q test case
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_sign_data, test_vector_ecdsa_sign_t test_vector_ecdsa_sign_secp256r1_sha512_inv_q) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp256r1_curve_info,
    .expected_sign_err_code     = NRF_SUCCESS,
    .expected_verify_err_code   = NRF_ERROR_CRYPTO_ECDSA_INVALID_SIGNATURE,
    .p_test_vector_name         = "secp256r1 Q changed sha512",
    .p_input                    = "a59ca4dd2b0347f4f2702a8962878a206775fd91047040be60463119f02aa829b7360b940b2785395406c280375c5d90ee655e51d4120df256b9a6287161c7fc",
    .p_qx                       = "f2a6674d4e86152a527199bed293fa63acde1b4d8a92b62e552210ba45c38792",
    .p_qy                       = "c72565c24f0eee6a094af341ddd8579747b865f91c8ed5b44cda8a19cc93776f",
    .p_x                        = "9dd0d3a3d514c2a8adb162b81e3adfba3299309f7d2018f607bdb15b1a25f499"
};

// ECDSA sign - NIST CAVS 11.2 P-256, SHA-256 - invalid X test case
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_sign_data, test_vector_ecdsa_sign_t test_vector_ecdsa_sign_secp256r1_sha256_inv_x) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp256r1_curve_info,
    .expected_sign_err_code     = NRF_SUCCESS,
    .expected_verify_err_code   = NRF_ERROR_CRYPTO_ECDSA_INVALID_SIGNATURE,
    .p_test_vector_name         = "secp256r1 X changed sha256",
    .p_input                    = "44acf6b7e36c1342c2c5897204fe09504e1e2efb1a900377dbc4e7a6a133ec56",
    .p_qx                       = "1ccbe91c075fc7f4f033bfa248db8fccd3565de94bbfb12f3c59ff46c271bf83",
    .p_qy                       = "ce4014c68811f9a21a1fdb2c0e6113e06db7ca93b7404e78dc7ccd5ca89a4ca9",
    .p_x                        = "0f56db78ca460b055c500064824bed999a25aaf48ebb519ac201537b85479813"
};

// ECDSA sign - NIST CAVS 11.2 P-256, SHA-512 - invalid X test case
NRF_SECTION_ITEM_REGISTER(test_vector_ecdsa_sign_data, test_vector_ecdsa_sign_t test_vector_ecdsa_sign_secp256r1_sha512_inv_x) =
{
    .p_curve_info               = &g_nrf_crypto_ecc_secp256r1_curve_info,
    .expected_sign_err_code     = NRF_SUCCESS,
    .expected_verify_err_code   = NRF_ERROR_CRYPTO_ECDSA_INVALID_SIGNATURE,
    .p_test_vector_name         = "secp256r1 X changed sha512",
    .p_input                    = "a59ca4dd2b0347f4f2702a8962878a206775fd91047040be60463119f02aa829b7360b940b2785395406c280375c5d90ee655e51d4120df256b9a6287161c7fc",
    .p_qx                       = "6b738de3398b6ac57b9591f9d7985dd4f32137ad3460dcf8970c1390cb9eaf8d",
    .p_qy                       = "83bc61e26d2bbbd3cf2d2ab445a2bc4ab5dde41f4a13078fd1d3cc36ab596d57",
    .p_x                        = "f9bf909b7973bf0e3dad0e43dcb2d7fa8bda49dbe6e5357f8f0e2bd119be30e6"
};
#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP256R1)

#if NRF_MODULE_ENABLED(NRF_CRYPTO_ECC_SECP384R1)

